In [1]:
%load_ext sql
%sql postgresql://user:password@172.20.0.1:15433/desafio_dados_blue3

# Desafio - Analista de Dados Jr.

Este desafio é destinada a avaliar suas habilidades em SQL e Python, focando em análises de dados com base em um modelo de banco de dados relacional. O modelo de dados inclui tabelas para clientes, produtos, pedidos, itens de pedido e categorias.

## Modelo de Dados

O banco de dados está estruturado conforme o diagrama ER abaixo, utilizando PostgreSQL:

```mermaid
erDiagram
    CLIENTES ||--o{ PEDIDOS : "tem"
    CLIENTES {
        int id_cliente PK "Chave primária"
        varchar nome "Nome do cliente"
        varchar email "Email do cliente"
        varchar telefone "Telefone do cliente"
        date data_cadastro "Data de cadastro"
        varchar endereco "Endereço do cliente"
    }

    CATEGORIAS ||--o{ PRODUTOS : "categoriza"
    CATEGORIAS {
        int id_categoria PK "Chave primária"
        varchar nome "Nome da categoria"
        text descricao "Descrição da categoria"
    }

    PRODUTOS ||--o{ ITENS_PEDIDO : "incluído_em"
    PRODUTOS {
        int id_produto PK "Chave primária"
        varchar nome "Nome do produto"
        decimal preco "Preço do produto"
        int quantidade_estoque "Quantidade em estoque"
        int id_categoria FK "Chave estrangeira para CATEGORIAS"
        text descricao "Descrição do produto"
    }

    PEDIDOS ||--o{ ITENS_PEDIDO : "contém"
    PEDIDOS {
        int id_pedido PK "Chave primária"
        int id_cliente FK "Chave estrangeira para CLIENTES"
        date data_pedido "Data do pedido"
        decimal valor_total "Valor total do pedido"
        varchar status "Status do pedido"
    }

    ITENS_PEDIDO {
        int id_item_pedido PK "Chave primária"
        int id_pedido FK "Chave estrangeira para PEDIDOS"
        int id_produto FK "Chave estrangeira para PRODUTOS"
        int quantidade "Quantidade do produto"
        decimal preco_unitario "Preço unitário do produto"
    }
```

## Instruções

Por favor, leia cada questão cuidadosamente e forneça sua solução. As questões de SQL devem ser respondidas com consultas que funcionem no PostgreSQL. Para as questões de Python, assuma que os dados necessários já foram extraídos do banco de dados e estão disponíveis na forma especificada.

#### 1. Análise de Clientes Recorrentes
- Escreva uma consulta SQL para identificar clientes que realizaram 2 ou mais compras no ano de 2023. Mostre o nome, e-mail e o total de compras.

In [2]:
%%sql
SELECT c.nome, c.email, COUNT(pe.id_pedido) AS total_compras
FROM CLIENTES c
JOIN PEDIDOS pe ON c.id_cliente = pe.id_cliente
WHERE EXTRACT(YEAR FROM pe.data_pedido) = 2023
GROUP BY c.nome, c.email
HAVING COUNT(pe.id_pedido) > 2;

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
2 rows affected.

[('Ana Silva', 'ana.silva@example.com', 5),
 ('Carla Gomes', 'carla.gomes@example.com', 3)]

#### 2. Último Pedido de Cada Cliente
- Escreva uma consulta SQL para encontrar os detalhes do último pedido feito por cada cliente.

In [3]:
%%sql
SELECT c.nome, p.*
FROM pedidos p
JOIN clientes c ON p.id_cliente = c.id_cliente
WHERE p.data_pedido IN (SELECT MAX(data_pedido) FROM pedidos GROUP BY id_cliente);

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
8 rows affected.

[('Bruno Martins', 10, 2, datetime.date(2023, 8, 10), Decimal('2065.00'), 'Em processamento'),
 ('Daniel Souza', 12, 4, datetime.date(2023, 8, 12), Decimal('2175.00'), 'Em processamento'),
 ('Eduardo Oliveira', 13, 5, datetime.date(2023, 8, 13), Decimal('2230.00'), 'Em processamento'),
 ('Fernanda Santos', 14, 6, datetime.date(2023, 8, 14), Decimal('2285.00'), 'Em processamento'),
 ('Gabriel Pereira', 15, 7, datetime.date(2023, 8, 15), Decimal('2340.00'), 'Em processamento'),
 ('Heloísa Lima', 16, 8, datetime.date(2023, 8, 16), Decimal('2395.00'), 'Em processamento'),
 ('Ana Silva', 19, 1, datetime.date(2023, 8, 19), Decimal('2560.00'), 'Em processamento'),
 ('Carla Gomes', 20, 3, datetime.date(2023, 8, 20), Decimal('2615.00'), 'Em processamento')]

#### 3. Valor Médio dos Pedidos por Categoria
- Crie uma consulta SQL que calcule o valor médio dos pedidos por categoria de produto. Mostre o nome da categoria e o valor médio.

In [4]:
%%sql
SELECT c.nome, AVG(pe.valor_total) AS valor_medio
FROM CATEGORIAS c
JOIN PRODUTOS p ON c.id_categoria = p.id_categoria
JOIN ITENS_PEDIDO i ON p.id_produto = i.id_produto
JOIN PEDIDOS pe ON i.id_pedido = pe.id_pedido
GROUP BY c.id_categoria
order by valor_medio desc

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
5 rows affected.

[('Eletrônicos', Decimal('2463.7500000000000000')),
 ('Vestuário', Decimal('2450.0000000000000000')),
 ('Alimentos', Decimal('2395.0000000000000000')),
 ('Esportes', Decimal('2312.5000000000000000')),
 ('Livros', Decimal('2285.0000000000000000'))]

#### 4. Distribuição do Status dos Pedidos
- Desenvolva uma consulta SQL para agrupar os pedidos por status, contando quantos pedidos existem em cada status. Liste o status e a quantidade.

In [5]:
%%sql
SELECT status, COUNT(id_pedido) AS quantidade
FROM PEDIDOS
GROUP BY status;

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
4 rows affected.

[('Entregue', 1), ('Em processamento', 17), ('Cancelado', 1), ('Enviado', 1)]

#### 5. Encontrar o produto mais caro de cada categoria.
- Escreva uma consulta SQL para encontrar o produto mais caro de cada categoria.

In [6]:
%%sql
SELECT c.nome AS categoria, p.nome, p.preco AS preco_maximo
FROM categorias c
JOIN produtos p ON c.id_categoria = p.id_categoria
INNER JOIN (
    SELECT id_categoria, MAX(preco) AS preco_maximo
    FROM produtos
    GROUP BY id_categoria
) pm ON p.id_categoria = pm.id_categoria AND p.preco = pm.preco_maximo
ORDER BY c.nome, p.preco DESC;

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
5 rows affected.

[('Alimentos', 'Pacote de Arroz 5kg', Decimal('22.00')),
 ('Eletrônicos', 'Smartphone XYZ', Decimal('1500.00')),
 ('Esportes', 'Bicicleta de Montanha', Decimal('1200.00')),
 ('Livros', 'Livro "O Senhor dos Anéis"', Decimal('60.00')),
 ('Vestuário', 'Calça Jeans', Decimal('120.00'))]

#### 6. Categorias Mais Lucrativas
- Utilize SQL para determinar as três categorias mais lucrativas, com base no valor total de vendas. Apresente o nome da categoria e o valor total de vendas.

In [7]:
%%sql
SELECT c.nome, SUM(i.quantidade * i.preco_unitario) AS valor_total_vendas
FROM CATEGORIAS c
JOIN PRODUTOS p ON c.id_categoria = p.id_categoria
JOIN ITENS_PEDIDO i ON p.id_produto = i.id_produto
GROUP BY c.id_categoria
ORDER BY valor_total_vendas DESC
LIMIT 3;

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
3 rows affected.

[('Esportes', Decimal('25500.00')),
 ('Eletrônicos', Decimal('21300.00')),
 ('Vestuário', Decimal('4400.00'))]

#### 7. Calcular a média de preços dos produtos (Python)
- Consulte utilizando SQL a tabela `produtos`. Com base nos dados consultados, crie um dicionário com o `id_produto` como chave e o `preco` como valor, e escreva um script Python para calcular a média de preços dos produtos utilizando python.

In [8]:
%%sql
select 
    p.id_produto,
    p.preco 
from produtos p;

 * postgresql://user:***@172.20.0.1:15433/desafio_dados_blue3
10 rows affected.

[(1, Decimal('1500.00')),
 (2, Decimal('45.00')),
 (3, Decimal('80.00')),
 (4, Decimal('22.00')),
 (5, Decimal('1200.00')),
 (6, Decimal('150.00')),
 (7, Decimal('60.00')),
 (8, Decimal('120.00')),
 (9, Decimal('5.00')),
 (10, Decimal('50.00'))]

In [9]:
produtos = {
    1: 1500.00,
    2: 45.00,
    3: 80.00,
    4: 22.00,
    5: 1200.00,
    6: 150.00,
    7: 60.00,
    8: 120.00,
    9: 5.00,
    10: 50.00
}

media = sum(produtos.values()) / len(produtos)
print(media)

323.2

#### 8. Listar produtos com preço superior a 100 reais (Python)
- Usando o mesmo dicionário produtos do exercício anterior, escreva um script Python para listar todos os produtos com preço superior a 100 reais.

In [10]:
produtos_acima_100 = {id_produto: preco for id_produto, preco in produtos.items() if preco > 100}
print("Produtos com preço superior a 100 reais:", produtos_acima_100)

Produtos com preço superior a 100 reais: {1: 1500.0, 5: 1200.0, 6: 150.0, 8: 120.0}